<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class AnimesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('animes')->insert([
            [
                'title' => 'Чёрный клевер',
                'original_title' => 'Black Clover',
                'slug' => 'black-clouver',
                'old' => 16,
                'image' => 'img/products/1.jpg',
                'hide_img' => 'image/hide_anime_image/1.jpg',
                'is_recommend' => 1,
                'rating' => 5,
                'description' => 'Их свела общая судьба. Аста и Юно - двое сирот, мечтающих найти своё место под солнцем и когда-нибудь прославиться как великие маги. Однако общая судьба - не общий дар, и, как это часто бывает, пока один достигает определённых успехов, другой вынужден плестись позади, не проявляя практически никакого таланта. Но друг, как известно, познаётся в беде. Когда Юно, получившему могущественный гримуар четырёхлистного клевера, угрожает опасность, Аста раскрывает весь свой потенциал и получает гримуар, на котором красуется клевер с пятью лепестками, прозванный «Чёрным».'
            ],
            [
                'title' => 'Маг на полную ставку',
                'original_title' => 'Quanzhi Fashi',
                'slug' => 'mag-na-polnuju-stavku',
                'old' => 16,
                'image' => 'img/products/2.jpg',
                'hide_img' => 'image/hide_anime_image/2.jpg',
                'is_recommend' => 1,
                'rating' => 5,
                'description' => 'Аниме про проникновение в иной мир имеют большую распространенность, и таковых отснят уже масса и маленькая тележка. Однако это отличается из числа всеобщей массы. Шестнадцатилетний Мофан обучается в старшей школе и великолепно поспевает в духовный познаниях. Однако как-то раз его обычная существование лихим способом поменялась. Дед-смотритель, беспрерывно смотрящий за задними воротами средние учебные заведения, неожиданно подарил Мофану старинный и поврежденный чёрный кулон. Мофан вначале не дал значимости данному презенту, и весьма напрасно. Решив передремнуть в прохладном атмосфере, Мофан комфортно пристроился на горе позади средние учебные заведения. Однако пробудился он в абсолютно другом мире. Причём не мгновенно было очевидно, в чём козни, так как все находящийся вокруг его люди остались совершенно теми же самыми. Однако поменялся сам уклад жизни существования, взамен академических познаний и технологий все сейчас исследуют волшебство! Вот это да! Хотя сначала Мофан отнюдь не мгновенно сумел приспособиться в новом обществе, и колдовство оказалась для него непростой наукой, однако после стало понятно, что ежели человек гениален в одном свете, в таком случае гением остается и в другом!'
            ],
            [
                'title' => 'Атака титанов',
                'original_title' => 'Shingeki no Kyojin',
                'slug' => 'shingeki-kyojin',
                'old' => 18,
                'image' => 'img/products/3.jpg',
                'hide_img' => 'image/hide_anime_image/3.jpg',
                'is_recommend' => 1,
                'rating' => 4,
                'description' => 'Уже многие годы человечество ведёт борьбу с титанами — огромными существами, которые не обладают особым интеллектом, зато едят людей и получают от этого удовольствие. После продолжительной борьбы остатки человечества построили высокую стену, окружившую страну людей, через которую титаны пройти не могли. С тех пор прошло сто лет, люди мирно живут под защитой стены. Но однажды подросток Эрэн и его сводная сестра Микаса становятся свидетелями страшного события — участок стены разрушается супертитаном, появившимся прямо из воздуха. Титаны нападают на город, и дети в ужасе видят, как один из монстров заживо съедает их мать. Эрэн клянётся, что убьёт всех титанов и отомстит за человечество.'
            ],
            [
                'title' => 'Моя геройская академия',
                'original_title' => 'Boku no Hero Academia',
                'slug' => 'my-hero-academia',
                'old' => 16,
                'image' => 'img/products/4.jpg',
                'hide_img' => 'image/hide_anime_image/4.jpg',
                'is_recommend' => 1,
                'rating' => 4,
                'description' => 'В некоем мире больший процент населения человечества рождается с необычными способностями, которые называются причудами. Но наш герой в этот процент не попал. Но парень упорно пытается достичь небывалой силы и приблизиться к своей мечте стать супергероем.'
            ],
            [
                'title' => 'Токийские мстители',
                'original_title' => 'Tokyo Revengers',
                'slug' => 'tokyo-revengers',
                'old' => 18,
                'image' => 'img/products/5.jpg',
                'hide_img' => 'image/hide_anime_image/5.jpg',
                'is_recommend' => 0,
                'rating' => 3,
                'description' => 'Однажды 26-летний неудачник Такэмити Ханагаки узнает, что его бывшая девушка Хината Татибана была убита токийской бандой Мандзикай. На следующий день парень попадает под поезд, но не умирает, а перемещается на 12 лет назад — в то время, когда он был в отношениях с Хинатой. Понимая, что у него есть шанс спасти её, Такэмити решает проникнуть в банду и уничтожить её изнутри.'
            ],
            [
                'title' => 'Ох, уж этот экстрасенс Сайки Кусуо!',
                'original_title' => 'Saiki Kusuo no Ψ-nan',
                'slug' => 'saiki-kusuo',
                'old' => 16,
                'image' => 'img/products/6.jpg',
                'hide_img' => 'image/hide_anime_image/6.jpg',
                'is_recommend' => 0,
                'rating' => 3,
                'description' => 'В семье Кусуо родился долгожданный ребёнок, но он был необычным малышом. Способность к чтению мыслей у него появилась через две недели после рождения. В один месяц мальчишка умел не только ходить, но и левитировать в воздухе. Вскоре у Сайки появилась новая уникальная сила и это телепортация. С каждым годом подросток обретал всё больше невероятных способностей, и к шестнадцати годам он стал сильнейшим из псиоников на Земле. Возможности юноши не имели границ, а потому он с лёгкостью может уничтожить всю планету, но ему это ни к чему. Школьник считает, что данный ему дар является настоящим проклятием, ведь он не может жить как обычный человек. У паренька никогда не было друзей, а также подруги и это его очень огорчает. Каждый на планете хотел бы обрести такое могущество, но вот только не Сайки. Отец парня вечно эксплуатирует сына, а мама наоборот заставляет сынишку использовать способности для добрых дел. В один прекрасный день у юноши появляется поклонница, которая не даёт ему проходу. Неужели жизнь псионика изменится в лучшую сторону, и он наконец-то сможет обрести счастье? Использование суперсил влечёт за собой огромную ответственность, а потому Сайки скрывает от окружающих о своих возможностях. Желаете познакомиться с сильнейшим псиоников на планете, тогда смотрите аниме "Saiki Kusuo no Psi Nan". Забавные и смешные приключения необычного школьника порадуют многих зрителей. Сможет ли парень завести не только настоящих друзей, но и любящую подругу?'
            ],
            [
                'title' => 'Добро пожаловать в класс превосходства',
                'original_title' => 'Youkoso Jitsuryoku Shijou Shugi no Kyoushitsu e',
                'slug' => 'shugi-no-kyoushitsu',
                'old' => 16,
                'image' => 'img/products/7.jpg',
                'hide_img' => 'image/hide_anime_image/7.jpg',
                'is_recommend' => 0,
                'rating' => 5,
                'description' => 'Старшая школа Кодо Икусэй – престижное учебное заведение с весьма неплохими показателями, где каждый ученик после выпуска гарантированно поступает в самый престижный институт и сможем найти работу. Ученикам дозволено ходить как они того пожелают: с любыми прическами, в любом виде, приносить с собой свои личные вещи. Каждому ученику при поступлении начисляют 100 очков (100000 йен), на которые они обязаны жить. Очки начисляются каждый месяц. На первый взгляд Кодо Икусэй – рай для любого ученика, но не так всё просто было. Очки начисляются за успеваемость в учебе, и в зависимости от ранга класса. В школе существует так называемая “эс-система”, по которой классы распределяются на ранги, по типу: D, C, B, A. Киётаки Аянокоджи – главный герой, который был направлен в класс D, в класс, куда управление школы “сливает” студентов с низкими способностями. Для того чтобы перейти на ранг выше, классу требуется набрать больше баллов на тесте, чем у класса что стоит на более высоком ранге, в таком случае класс, что превзошёл другой, станет на его место, а другой класс опуститься ниже. После встречи с Сузунэ Хорикитой и Кикё Кушидой его положение начинает меняться. Сможет ли наш герой со своими одноклассниками подняться выше – увидим при просмотре.'
            ],
            [
                'title' => 'Расколотая битвой синева небес',
                'original_title' => 'Battle Through the Heavens',
                'slug' => 'raskolotaya-bitvoy-sineva-nebes',
                'old' => 18,
                'image' => 'img/products/8.jpg',
                'hide_img' => 'image/hide_anime_image/8.jpg',
                'is_recommend' => 1,
                'rating' => 5,
                'description' => 'Чтобы пробудить Яо Чэна, своего учителя, Сяо Янь отправляется в столицу на собрание мастеров пилюль. Его силу тут же заметили, люди которые захотели ей воспользоваться, но в решающий момент Сяо Янь всё же становится чемпионом и защищает честь империи. На Сяо Янь ждёт встреча, к которой он готовился целых три года...'
            ],
            [
                'title' => 'Ванпачмен',
                'original_title' => 'One Punch Man',
                'slug' => 'one-punch-man',
                'old' => 18,
                'image' => 'img/products/9.jpg',
                'hide_img' => 'image/hide_anime_image/9.jpg',
                'is_recommend' => 1,
                'rating' => 4,
                'description' => 'Каково живётся самому сильному человеку в мире? Не так уж и классно, как может показаться на первый взгляд. Когда ты всего достиг, научившись выносить злодеев буквально с одного удара, жизнь теряет краски, пропадает сам интерес к жизни, ведь не к чему стремиться. С подобным внутренним кризисом сталкивается Сайтама - самый сильный человек на планете, погрязший в рутине и потерявший радость от побед над монстрами и преступниками. Его знакомство с киборгом Геносом открывает Сайтаме новый мир супергероев - друзья записываются в супергеройскую ассоциацию, чтобы от имени правосудия бороться со злом, однако сильнейшему в мире всё так же скучно… «One-Punch Man» побил все рекорды популярности в 2015 году, на полноправной основе став главным хитом года и заслужив признание поклонников аниме по всему миру за счёт головокружительной проработки боевых сцен и, разумеется, хорошего юмора.'
            ],
            [
                'title' => 'Первый сезон Наруто',
                'original_title' => 'NARUTO 1 season',
                'slug' => 'naruto-season-1',
                'old' => 18,
                'image' => 'img/products/10.jpg',
                'hide_img' => 'image/hide_anime_image/10.jpg',
                'is_recommend' => 0,
                'rating' => 3,
                'description' => 'Познакомьтесь с Наруто Узумаки – юным ниндзя, которому предстоит пройти долгий путь к своей мечте. Однако для достижения любой цели нужны верные товарищи, которых Наруто предстоит обрести. Эта история о том, как найти в себе силы не сдаваться, когда никто вокруг не верит в успех. А ещё это исключительная и неповторимая в своём роде классика – самое занимательное приключение ниндзя всех времён!'
            ],
            [
                'title' => 'О моём перерождении в слизь',
                'original_title' => 'Tensei shitara Slime Datta Ken',
                'slug' => 'slime-datta-ken',
                'old' => 18,
                'image' => 'img/products/11.jpg',
                'hide_img' => 'image/hide_anime_image/11.jpg',
                'is_recommend' => 1,
                'rating' => 4,
                'description' => 'Как только ни перерождались герои фэнтезийных аниме - встречали богинь и даже превращались в маленьких девочек. Однако в мир иной можно отправиться и в более... оригинальной форме. Название сериала говорит само за себя: "О моём перерождении в слизь" - история о мужчине средних лет, который погиб от рук грабителя и неожиданно очутился в другом мире, причём не в своём привычном обличии, а в форме сгустка слизи с удивительной способностью поглощать всё на своём пути. Так начались его странные похождения в странном мире в компании не менее странных людей, которые встретятся ему на пути.'
            ],
            [
                'title' => 'Тетрадь смерти',
                'original_title' => 'Death Note',
                'slug' => 'death-note',
                'old' => 18,
                'image' => 'img/products/12.jpg',
                'hide_img' => 'image/hide_anime_image/12.jpg',
                'is_recommend' => 0,
                'rating' => 3,
                'description' => 'Жить человеку или не жить определяют боги смерти, рано или поздно внося его имя в особую тетрадь. Одна из таких тетрадей попадает в мир людей на территорию современной Японии. А что случится, если тетрадь бога Death Note окажется в руках человека? Ответ очевиден: он возомнит себя богом. Это и происходит с Ягами Лайтом - среднестатистическим, но не совсем обычным старшеклассником, мечтающим построить утопию на трупах преступников. «Тетрадь Смерти» обрела невероятную популярность в начале века онлайн, сделав историю противостояния Киры и гениального детектива L классикой детективного жанра и просто культовым аниме.'
            ],
            [
                'title' => 'Синий Экзорцист',
                'original_title' => 'Ao no Exorcist',
                'slug' => 'ao-no-exorcist',
                'old' => 18,
                'image' => 'img/products/13.jpg',
                'hide_img' => 'image/hide_anime_image/13.jpg',
                'is_recommend' => 1,
                'rating' => 3,
                'description' => 'Долгое время Окумура Рин жил жизнью обычного человека, пока не обнаружил в себе невероятную силу. Оказалось, что он - полукровка и один из сыновей Дьявола, живущий в мире людей. У владыки демонов на наследника свои планы, но Рин, будучи наполовину человеком и прожив с людьми много лет, не желает становиться пешкой в руках Сатаны и вместе с братом Юкио поступает в особую школу демоноборцев, зовущих себя экзорцистами, выбирая сторону людей в грядущей войне. История молодого экзорциста стала хитом 2011 года - замечательный визуальный стиль, музыкальное сопровождение и яркие герои не оставят поклонников сёненов равнодушными.'
            ],
            [
                'title' => 'Магическая битва',
                'original_title' => 'Jujutsu Kaisen',
                'slug' => 'jujutsu-kaisen',
                'old' => 18,
                'image' => 'img/products/14.jpg',
                'hide_img' => 'image/hide_anime_image/14.jpg',
                'is_recommend' => 0,
                'rating' => 3,
                'description' => 'Несмотря на врожденный спортивный талант, старшеклассник Юдзи Итадори всячески отказывается принимать участие в соревнованиях, а однажды решает присоединиться к клубу оккультных исследований. Обнаружив, что члены клуба — настоящие колдуны, способные манипулировать энергией живых существ, школьник сталкивается с Мегуни Фусигуро, который открывает страшную тайну о том, что Юдзи недавно контактировал с проклятым артефактом в виде гниющего пальца Сукуны. Это открытие навлекает на Итадори серьезные неприятности, поскольку Идзи вынужден стать хозяином Сукуны, а руководство Токийского колледжа магии приговаривает его к смертной казни.'
            ],
            [
                'title' => 'Не издевайся, Нагаторо',
                'original_title' => 'Ijiranaide, Nagatoro-san',
                'slug' => 'nagatoro-san',
                'old' => 18,
                'image' => 'img/products/15.jpg',
                'hide_img' => 'image/hide_anime_image/15.jpg',
                'is_recommend' => 0,
                'rating' => 3,
                'description' => 'Учиться в старшей школе всегда было сложно, но для Семпая такая жизнь кажется настоящим кошмаром. Мальчишка давно отстранился от сверстников, и он ведёт уединённый образ жизни. Юноша увлекается рисованием, а также храбрыми рыцарями, которые спасают красавиц от ужасных чудовищ. Вот только на своих героев мальчишка ничуть не похож, ведь он не только стеснительный, но и довольно трусливый человек. Однажды девчонки забрали рисунки юноши, и они начали насмехаться, но в это время подошла новенькая Нагаторо, которая недавно перевелась в школу неудачника. Девушка обладает неистовой красотой, а также она имеет боевой характер. Семпай решил познакомиться с Нагаторо, и это стало его огромной ошибкой, ведь за красивым личиком скрывался настоящий дьявол в юбке. После первого же знакомства школьница умудрилась довести подростка до слёз. На второй день она попросила паренька нарисовать её, но всё это опять закончилось унижением. После школы Нагаторо и вовсе засмущала паренька, ведь она предложила ему встречаться. До появления бесовки жизнь Семпая была кошмаром, но теперь она превратилась в настоящий ад. Необычную историю отношений между бойкой школьницей и стеснительным подростком можно увидеть в аниме "Ijiranaide, Nagatoro-san". Нагаторо не зря ведёт себя так дерзко, а потому Семпаю придётся узнать секрет из жизни девушки, который поможет ему сблизиться с красавицей.'
            ],
            [
                'title' => 'Боевой континент',
                'original_title' => 'Douluo Dalu',
                'slug' => 'boevoy-kontinent',
                'old' => 18,
                'image' => 'img/products/16.png',
                'hide_img' => 'image/hide_anime_image/16.jpg',
                'is_recommend' => 1,
                'rating' => 5,
                'description' => 'Молодой парнишка Танг Сан однажды оступился и следуя своим желаниям и прихотям ворует секретные учения в свое школе боевых искусств. Но постепенно его начинает мучить совесть и единственный способ искупления грехов он видит в самоубийстве. После чего он решается спрыгнуть с величественной горы. Но к своему удивлению после этого поступка он не умирает, а лишь перерождается в духовном мире под названием Боевой континент. Где главная цель всех обитателей этого загробного мира достичь совершенства и по праву обладать титулом Мастер духов! Получится ли это у нашего героя? Какие его еще ждут приключения на этом континенте?'
            ],
            [
                'title' => 'Клинок, рассекающий демонов',
                'original_title' => 'Kimetsu no Yaiba',
                'slug' => 'kimetsu-yaiba',
                'old' => 18,
                'image' => 'img/products/17.jpg',
                'hide_img' => 'image/hide_anime_image/17.jpg',
                'is_recommend' => 1,
                'rating' => 5,
                'description' => 'Ходят слухи, что в местных лесах обитают кровожадные демоны, которые питаются человеческой плотью. Вот только последние инциденты были так давно, что люди позабыли об опасностях дремучих лесов. Многие жители деревни считают, что сказание о демонах это просто страшилки и легенды. Танджиро Камадо живёт в маленькой деревушке, и он заботится о своей семье, ведь недавно исчез отец. Парню приходится работать на шахте и продавать уголь в городе. Очередная поездка на рынок не сулила неприятностей, но по возвращении домой парня ожидало чудовищное зрелище. Камадо увидел окровавленные тела родственников, которые были разбросаны во дворе. Оказалось, что лесные демоны напали на деревню и вырезали всех жителей. Чудом удалось выжить сестрёнке Нэзуко, но и у неё были проблемы, ведь существа превратили её в демона. Фэнтезийный мир наполнен жуткими тварями и разными опасностями, с которыми придётся повстречаться храброму Танджиро. Если смотреть аниме "Kimetsu no Yaiba" можно узнать, сможет ли юноша помочь сестре избавиться от проклятия, а также отыскать убийц семьи.'
            ],
        ]);
    }
}
